roomedy/app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "start_time", "end_time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@event = current_user.events.build(event_params)
		if @event.save

SELECT "events".* FROM "events" GROUP BY DATE(start_time)  ORDER BY DATE(start_time)
SELECT COUNT(*) FROM "events"
---
	def index
		@events = Event.paginate(page: params[:page])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "events" SET "start_time" = ?, "end_time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start_time", "2019-11-20 12:17:00.000000"], ["end_time", "2020-11-20 12:17:00.000000"], ["updated_at", "2015-11-11 17:17:54.736203"], ["id", 1]]
---
	def update
		@event = Event.find(params[:id])
		if @event.update_attributes(event_params)