roomedy/app/controllers/houses_controller.rb

INSERT INTO "relationships" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-10-14 17:08:17.712969"], ["updated_at", "2015-10-14 17:08:17.712969"]]
INSERT INTO "houses" ("name", "street", "city", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Name"], ["street", "Street"], ["city", "Plainfield"], ["state", "Indiana"], ["zip", 46168], ["created_at", "2015-10-11 02:02:13.402380"], ["updated_at", "2015-10-11 02:02:13.402380"]]
INSERT INTO "permissions" ("user_id", "level", "permissable_id", "permissable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 0], ["level", 1], ["permissable_id", 1], ["permissable_type", "House"], ["created_at", "2015-11-01 21:59:38.041608"], ["updated_at", "2015-11-01 21:59:38.041608"]]
UPDATE "relationships" SET "house_id" = ?, "updated_at" = ? WHERE "relationships"."id" = ?  [["house_id", 1], ["updated_at", "2015-10-14 17:08:17.818639"], ["id", 1]]
---
	def create
		@house = House.new(house_params)
		@house.permissions.build
		@relationship = Relationship.create()
		current_user.relationship = @relationship
		@house.relationships << @relationship
		if @house.save
			@house.permissions.create(user_id: 0, level: 1)
			@house.permissions.create(user_id: current_user.id, level: 0)
			if current_user.save(validate: false)

UPDATE "houses" SET "name" = ?, "updated_at" = ? WHERE "houses"."id" = ?  [["name", "The Trap House"], ["updated_at", "2015-11-01 21:35:20.590919"], ["id", 1]]
---
	def update
		@house = House.find(params[:id])
		if @house.update_attributes(house_params)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."house_id" = ? AND "id"."user_id" = 'user_id' AND "id"."house_id" = 'id' LIMIT 1  [["house_id", 1]]
---
	def remove
		@house = House.find(params[:id])
		@house.relationships.find_by(user_id: params[:user_id]).destroy

DELETE FROM "permissions" WHERE "permissions"."id" = ?  [["id", 3]]
INSERT INTO "permissions" ("user_id", "level", "permissable_id", "permissable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["level", 0], ["permissable_id", 1], ["permissable_type", "House"], ["created_at", "2015-11-02 00:26:50.425957"], ["updated_at", "2015-11-02 00:26:50.425957"]]
---
	def promote
		@house = House.find(params[:id])
		@house.permissions.find_by(user_id: current_user.id).destroy
		@house.permissions.create(user_id: params[:user_id], level: 0)