roomedy/app/controllers/invitation_controller.rb

SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."house_id" = ?  ORDER BY "relationships"."id" ASC LIMIT 1  [["house_id", 1]]
INSERT INTO "relationships" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-01 22:45:31.092593"], ["updated_at", "2015-11-01 22:45:31.092593"]]
---
  def show
    @house = House.find_by_id(params[:id])
    if @house.nil?
      render 'error'
    end
    if logged_in? && params[:accept] == "true"
        unless current_user.relationship.nil?
          current_user.relationship.destroy
        end

        puts "HOUSES COUNT" + @house.relationships.count.to_s

        @relationship = Relationship.create()