roomedy/app/controllers/items_controller.rb

INSERT INTO "items" ("item_amount", "item_price", "item_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_amount", 5], ["item_price", 80], ["item_name", "Cocaine"], ["user_id", 1], ["created_at", "2015-10-16 16:40:29.935385"], ["updated_at", "2015-10-16 16:40:29.935385"]]
---
    def create
        @item = current_user.items.build(item_params)
        if @item.save

SELECT COUNT(*) FROM "items"
---
    def index
        @items = Item.paginate(page: params[:page])