roomedy/app/controllers/notes_controller.rb

  def create
  	@note = current_user.notes.build(note_params)
  	if @note.save
      @perm_user = @note.permissions.create(user_id: current_user.id, level: 0)
---
INSERT INTO "notes" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This is a new note"], ["user_id", 1], ["created_at", "2015-10-16 15:36:41.280368"], ["updated_at", "2015-10-16 15:36:41.280368"]]
INSERT INTO "permissions" ("user_id", "level", "permissable_type", "permissable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 0], ["level", 3], ["permissable_type", "Note"], ["permissable_id", 1], ["created_at", "2015-11-06 17:43:48.369447"], ["updated_at", "2015-11-06 17:43:48.369447"]]

  def index
  	@notes = Note.paginate(page: params[:page])
---
SELECT  "notes".* FROM "notes"  ORDER BY "notes"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "notes"

  def edit
    @note = Note.find(params[:id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ?  ORDER BY "notes"."created_at" DESC LIMIT 1  [["id", 1]]

  def update
    @note = Note.find(params[:id])
    permparams = (params[:note][:permission].permit!)
    permparams.each_key do |key|
      perm = Permission.find(key)
      perm.level = permparams[key][:level]
      perm.save
    end

    if @note.update_attributes(note_params)
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ?  ORDER BY "notes"."created_at" DESC LIMIT 1  [["id", 1]]
UPDATE "notes" SET "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["content", "New Note"], ["updated_at", "2015-10-16 17:01:47.041183"], ["id", 1]]