roomedy/app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @notes = @user.notes.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."user_id" = ?  ORDER BY "notes"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]

  def create
    @user = User.new(user_params)
	  if @user.save
      log_in @user
	    flash[:success] = "Welcome!"

      default_notificaiton()

	    unless params[:user][:invite].nil?
        @house = House.find_by_id(params[:user][:invite])
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]