roomedy/app/views/items/index.html.erb

	<ul class="items">
	  <% House.find(current_user.relationship.house_id).items.each do |item| %>
---
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "items".* FROM "items" INNER JOIN "users" ON "items"."user_id" = "users"."id" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."house_id" = ?  [["house_id", 1]]

	      <%= link_to "delete", item, method: :delete, data: {confirm: "Are you sure?"}%>
	      <div align="right">Created by: <%= User.find(item.user_id).name %></div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]