roomedy/app/views/houses/show.html.erb

<br/>
<% @house.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."house_id" = ?  [["house_id", 1]]