app/views/houses/edit.html.erb

SELECT "users".* FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."house_id" = ?  [["house_id", 1]]
---
    <ul>
      <% @house.users.each do |user| %>