roomedy/app/views/notes/index.html.erb

	<ul class="notes">
	  <% House.find(current_user.relationship.house_id).notes.each do |note| %>
---
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "notes".* FROM "notes" INNER JOIN "users" ON "notes"."user_id" = "users"."id" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."house_id" = ?  ORDER BY "notes"."created_at" DESC  [["house_id", 1]]

	      <%= note.content %>
	      <div align="right">Created by: <%= User.find(note.user_id).name %></div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]