roomedy/app/views/invitation/show.html.erb

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."house_id" = ?  ORDER BY "relationships"."id" ASC LIMIT 1  [["house_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
      begin
        @user = User.find_by_id(@house.relationships.first.user_id)