roomedy/app/views/events/index.html.erb

	<ul class="events">
		<% current_user.events.each do |event| %>
---
SELECT "events".* FROM "events" GROUP BY DATE(start_time)  ORDER BY DATE(start_time)