app/views/users/show.html.erb

<% if !@user.relationship.nil? %>
	<div class="center"><%= House.find_by(@user.relationship.house_id).name %></div>
---
SELECT  "houses".* FROM "houses" WHERE (1) LIMIT 1
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? LIMIT 1  [["user_id", 1]]