roomedy/app/views/layouts/_header.html.erb

SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
          <% if !current_user.relationship.nil? %>
            <%= link_to "House", House.find(current_user.relationship.house_id), class: "btn btn-house" %>