app/views/pages/home.html.erb

            <div class="login_links">
              <%= link_to "House", House.find(current_user.relationship.house_id), class: "btn btn-house" %>
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? LIMIT 1  [["user_id", 2]]