app/views/items/index.html.erb

SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? LIMIT 1  [["user_id", 2]]
SELECT "users".* FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."house_id" = ?  [["house_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---

      <% House.find(current_user.relationship.house_id).users.each do |user| %>
      	<% user.items.each do |compare_item| %>

SELECT "items".* FROM "items" INNER JOIN "users" ON "items"."user_id" = "users"."id" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."house_id" = ?  [["house_id", 1]]
---
	  <h1>Public Inventory</h1>
	  <% House.find(current_user.relationship.house_id).items.each do |item| %>