app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "street", "city", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Derek's House"], ["street", "1"], ["city", "Lafayette"], ["state", "IN"], ["zip", 47904], ["created_at", "2015-10-27 15:40:38.054742"], ["updated_at", "2015-10-27 15:40:38.054742"]]
INSERT INTO "permissions" ("user_id", "level", "permissable_id", "permissable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 0], ["level", 1], ["permissable_id", 1], ["permissable_type", "House"], ["created_at", "2015-11-07 04:44:40.342380"], ["updated_at", "2015-11-07 04:44:40.342380"]]
---
	def create
		@house = House.new(house_params)
		@house.permissions.build

		@house.add_user(current_user)

		if @house.save