app/controllers/invitation_controller.rb

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
INSERT INTO "relationships" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-07 04:44:57.304669"], ["updated_at", "2015-11-07 04:44:57.304669"]]
---
  def show
    @invitation = Invitation.where(:token => params[:token]).first
    if @invitation.nil?
      render 'error'
    end
    @house = @invitation.house

    if logged_in? && params[:accept] == "true"
        unless current_user.relationship.nil?
          current_user.relationship.destroy
        end

        @relationship = Relationship.create()