app/controllers/items_controller.rb

    def create
        @item = current_user.items.build(item_params)
        if @item.save
---
INSERT INTO "items" ("item_amount", "item_price", "item_name", "visibility", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item_amount", 2], ["item_price", 4.0], ["item_name", "a"], ["visibility", "f"], ["user_id", 1], ["created_at", "2015-11-13 18:03:25.546919"], ["updated_at", "2015-11-13 18:03:25.546919"]]

    def index
        @items = Item.paginate(page: params[:page])
---
SELECT  "items".* FROM "items" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "items"

    def update
         @item = Item.find(params[:id])
         @item.prev_amount = @item.item_amount
         if @item.update_attributes(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "items" SET "prev_amount" = ?, "item_amount" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["prev_amount", 10], ["item_amount", 0], ["updated_at", "2015-11-13 21:04:17.924860"], ["id", 1]]