app/controllers/notes_controller.rb

INSERT INTO "notes" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This is a note."], ["user_id", 2], ["created_at", "2015-10-27 15:41:25.416300"], ["updated_at", "2015-10-27 15:41:25.416300"]]
INSERT INTO "permissions" ("user_id", "level", "permissable_type", "permissable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["level", 100], ["permissable_type", "Note"], ["permissable_id", 1], ["created_at", "2015-11-02 16:35:25.807412"], ["updated_at", "2015-11-02 16:35:25.807412"]]
---
  def create
  	@note = current_user.notes.build(note_params)
    @note.house_id = current_user.relationship.house_id
  	if @note.save
      @perm_user = @note.permissions.create(user_id: current_user.id, level: 0)

SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? LIMIT 1  [["user_id", 2]]
SELECT "notes".* FROM "notes" INNER JOIN "users" ON "notes"."user_id" = "users"."id" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."house_id" = ?  ORDER BY "notes"."created_at" DESC  [["house_id", 1]]
SELECT COUNT(*) FROM "notes"
---
  def index
    h = House.find(current_user.relationship.house_id)
  	@notes = h.notes.paginate(page: params[:page])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ?  ORDER BY "notes"."created_at" DESC LIMIT 1  [["id", 7]]
---
  def edit
    @note = Note.find(params[:id])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ?  ORDER BY "notes"."created_at" DESC LIMIT 1  [["id", 7]]
SELECT  "permissions".* FROM "permissions" WHERE "permissions"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "permissions" SET "level" = ?, "updated_at" = ? WHERE "permissions"."id" = ?  [["level", 3], ["updated_at", "2015-11-07 04:28:49.331644"], ["id", 7]]
UPDATE "notes" SET "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["content", "uh mer"], ["updated_at", "2015-11-05 19:27:43.444383"], ["id", 32]]
---
  def update
    @note = Note.find(params[:id])
    permparams = (params[:note][:permission].permit!)
    permparams.each_key do |key|
      perm = Permission.find(key)
      perm.level = permparams[key][:level]
      perm.save
    end

    if @note.update_attributes(note_params)