app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.user_id = current_user.id

    if @seller = House.find(current_user.relationship.house_id).users.where(name: @transaction.seller)
      if (!(@seller.first.nil?) && (@seller.first.id != current_user.id))
        puts "FOUND SELLER"
        @sellertransaction = Transaction.new(transaction_params)
        @sellertransaction.user_id = @seller.first.id
        @sellertransaction.price = @sellertransaction.price * -1
        @sellertransaction.save
---
SELECT  "users".* FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."house_id" = ? AND "users"."name" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["house_id", 1], ["name", "Derek Schrag"]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ?  [["user_id", 1]]
INSERT INTO "transactions" ("user_id", "buyer", "seller", "recurring", "reason", "price_cents", "date_due", "date_paid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @transaction.update(transaction_params)
---
UPDATE "transactions" SET "seller" = ?, "price_cents" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["seller", 0], ["price_cents", 2000], ["updated_at", "2015-11-12 01:58:17.254599"], ["id", 2]]