app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    puts "Creating finance"
	  if @user.save
      @user.finance = Finance.create(user_id: @user.id)
      log_in @user
	    flash[:success] = "Welcome!"

	    unless params[:user][:invite].nil?
        @house = House.find_by_id(params[:user][:invite])
        unless @house.nil?
          @relationship = Relationship.create()
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "relationships" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-10-27 18:10:42.600324"], ["updated_at", "2015-10-27 18:10:42.600324"]]