app/views/application/_permission_edit.html.erb

SELECT "permissions".* FROM "permissions"
---
<% obj.permissions.each do |perm| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 0]]
---
    <% if perm.user_id != 0 %>
      <% @permuser = User.find(perm.user_id)   %>